-- 회원 테이블에 테스트 데이터 삽입
INSERT INTO `member` (`mem_email`, `mem_pwd`, `mem_name`, `mem_phone`, `mem_zipcode`, `mem_addr`, `mem_detail_addr`, `mem_bank`, `mem_acc`, `mem_auth`, `mem_status`)
VALUES
    ('aaa@etest.com', '1111', '사용자', '010-1234-5678', '12345', '주소1', '상세주소1', '국민은행', '1234567890', 'M', 'Y'),
    ('bbb@test.com', '1111', '관리자', '010-5678-1234', '54321', '주소2', '상세주소2', '하나은행', '0987654321', 'A', 'Y');

-- 작품 테이블에 테스트 데이터 삽입
INSERT INTO `art` (`art_title`, `art_writer`, `art_category`, `start_price`, `buy_now_price`, `bid_price_per`, `start_datetime`, `end_datetime`, `art_status`)
VALUES
    ('동양화1', '동작가', 'E', 10000, 20000, 1000, NOW(), NOW(), 'R'),
    ('서양화1', '서작가', 'W', 15000, 25000, 2000, NOW(), NOW(), 'R'),
    ('공예품1', '공작가', 'P', 15000, 25000, 3000, NOW(), NOW(), 'R'),
    ('기타작품1', '기작가', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화2', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화2', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품2', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품2', '작자미상', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화3', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화3', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품3', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품3', '기작가', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화4', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화4', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품4', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품4', '작자미상', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화5', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화5', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품5', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품5', '작자미상', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화6', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화6', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품6', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품6', '기작가', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화7', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화7', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품7', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품7', '작자미상', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화7', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화7', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품7', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품7', '기작가', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화8', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화8', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품8', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품8', '작자미상', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화9', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화9', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품9', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품9', '기작가', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화10', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화10', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품10', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품10', '작자미상', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화11', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화11', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품11', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품11', '기작가', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화12', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화12', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품12', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품12', '기작가', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R');


-- 경매 입찰 테이블에 테스트 데이터 삽입
INSERT INTO `bid` (`art_no`, `mem_no`, `bid_price`)
VALUES
    (1, 1, 12000),
    (1, 2, 13000),
    (2, 1, 16000);

-- 파일 테이블에 테스트 데이터 삽입
INSERT INTO `attach` (`art_no`, `file_path`, `origin_file_name`, `save_file_name`)
VALUES
    (1, '/path/to/file1.jpg', 'file1.jpg', 'file1_saved.jpg'),
    (2, '/path/to/file2.jpg', 'file2.jpg', 'file2_saved.jpg');

-- FAQ 테이블에 테스트 데이터 삽입
INSERT INTO `faq` (`mem_no`, `faq_title`, `faq_content`)
VALUES
    (1, 'FAQ 1', 'FAQ 내용 1'),
    (2, 'FAQ 2', 'FAQ 내용 2');

-- 결제 테이블에 테스트 데이터 삽입
INSERT INTO `pay` (`mem_no`, `art_no`, `pay_price`)
VALUES
    (1, 1, 20000),
    (2, 2, 25000);


