-- 회원 테이블에 테스트 데이터 삽입
INSERT INTO member (mem_email, mem_pwd, mem_name, mem_phone, mem_zipcode, mem_addr, mem_detail_addr, mem_bank, mem_acc, mem_auth, mem_status)
VALUES
    ('aaa@test.com', '1111', 'aaa', '010-1234-5678', '12345', '주소1', '상세주소1', '국민은행', '1234567890', 'M', 'Y'),
    ('bbb@test.com', '1111', 'bbb', '010-5678-1234', '54321', '주소2', '상세주소2', '하나은행', '0987654321', 'A', 'Y'),
    ('ccc@test.com', '1111', 'ccc', '010-5474-2388', '45787', '주소3', '상세주소3', '농협은행', '2457689087', 'M', 'Y'),
    ('ddd@test.com', '1111', 'ddd', '010-8975-4149', '24678', '주소4', '상세주소4', '신한은행', '7984658694', 'M', 'N'),
    ('eee@test.com', '1111', 'eee', '010-2369-3467', '17997', '주소5', '상세주소5', '우리은행', '6898767586', 'A', 'Y'),
    ('fff@test.com', '1111', 'fff', '010-3456-5574', '00984', '주소6', '상세주소6', '국민은행', '8321097652', 'M', 'Y'),
    ('ggg@test.com', '1111', 'ggg', '010-8921-2289', '90983', '주소7', '상세주소7', '기업은행', '4578787390', 'A', 'Y'),
    ('hhh@test.com', '1111', 'hhh', '010-1054-9865', '35806', '주소8', '상세주소8', '하나은행', '2467898508', 'M', 'N'),
    ('iii@test.com', '1111', 'iii', '010-7904-2379', '34652', '주소9', '상세주소9', '신한은행', '4576867075', 'M', 'Y'),
    ('jjj@test.com', '1111', 'jjj', '010-3478-2679', '64564', '주소10', '상세주소10', '우리은행', '0098765361', 'M', 'N'),
    ('kkk@test.com', '1111', 'kkk', '010-3457-1666', '18954', '주소11', '상세주소11', '농협은행', '2459034678', 'M', 'Y');

-- 작품 테이블에 테스트 데이터 삽입
INSERT INTO art (art_title, art_writer, art_category, start_price, buy_now_price, bid_price_per, start_datetime, end_datetime, art_status)
VALUES
    ('동양화1', '동작가', 'E', 10000, 20000, 1000, NOW(), NOW(), 'R'),
    ('서양화1', '서작가', 'W', 15000, 25000, 2000, NOW(), NOW(), 'R'),
    ('공예품1', '공작가', 'P', 15000, 25000, 3000, NOW(), NOW(), 'R'),
    ('기타작품1', '기작가', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화2', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화2', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품2', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품2', '작자미상', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화3', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화3', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품3', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품3', '기작가', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화4', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화4', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품4', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품4', '작자미상', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화5', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화5', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품5', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품5', '작자미상', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화6', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화6', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품6', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품6', '기작가', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화7', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화7', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품7', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품7', '작자미상', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화7', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화7', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품7', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품7', '기작가', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화8', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화8', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품8', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품8', '작자미상', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화9', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화9', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품9', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품9', '기작가', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화10', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화10', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품10', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품10', '작자미상', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화11', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화11', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품11', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품11', '기작가', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R'),
    ('동양화12', '동작가', 'E', 15000, 25000, 4000, NOW(), NOW(), 'R'),
    ('서양화12', '서작가', 'W', 15000, 25000, 5000, NOW(), NOW(), 'R'),
    ('공예품12', '공작가', 'P', 15000, 25000, 6000, NOW(), NOW(), 'R'),
    ('기타작품12', '기작가', 'X', 15000, 25000, 7000, NOW(), NOW(), 'R');


-- 경매 입찰 테이블에 테스트 데이터 삽입
INSERT INTO bid (art_no, mem_no, bid_price)
VALUES
    (1, 1, 12000),
    (1, 2, 13000),
    (1, 3, 13000),
    (2, 1, 14000),
    (2, 2, 15000),
    (2, 3, 16000);

-- 파일 테이블에 테스트 데이터 삽입
INSERT INTO attach (art_no, file_path, origin_file_name, save_file_name)
VALUES
    (1, '/path/to/file1.jpg', 'file1.jpg', 'file1_saved.jpg'),
    (1, '/path/to/file2.jpg', 'file2.jpg', 'file2_saved.jpg'),
    (1, '/path/to/file3.jpg', 'file3.jpg', 'file3_saved.jpg'),
    (2, '/path/to/file4.jpg', 'file4.jpg', 'file4_saved.jpg'),
    (2, '/path/to/file5.jpg', 'file5.jpg', 'file5_saved.jpg'),
    (2, '/path/to/file6.jpg', 'file6.jpg', 'file6_saved.jpg');

-- FAQ 테이블에 테스트 데이터 삽입
INSERT INTO faq (mem_no, faq_title, faq_content)
VALUES
    (1, 'FAQ 1', 'FAQ 내용 1'),
    (2, 'FAQ 2', 'FAQ 내용 2'),
    (3, 'FAQ 3', 'FAQ 내용 3'),
    (4, 'FAQ 4', 'FAQ 내용 4');

-- 결제 테이블에 테스트 데이터 삽입
INSERT INTO pay (mem_no, art_no, pay_price)
VALUES
    (1, 3, 13000),
    (2, 3, 16000);